{
  "tutorialSteps": [
    {
      "target": ".v-step-0",
      "title": "Adding Endpoints",
      "content": "A Zigbee application can have multiple endpoints. Each endpoint contains a device configuration made up of Clusters on that endpoint. Add a new endpoint to your application by clicking <strong>ADD NEW ENDPOINT</strong> in the top left corner of the ZCL Advanced Platform (ZAP) interface.",
      "before": "startTutorialAndCloseTheEndpointModal",
      "placement": "bottom"
    },
    {
      "target": ".v-step-1",
      "title": "",
      "content": "To change the number of the endpoint on which you would like this device to appear, change the <strong>Endpoint</strong> setting.",
      "before": "openEndpointModal",
      "placement": "left"
    },
    {
      "target": ".v-step-2",
      "title": "",
      "content": "From here you can select whether you would like the endpoint to represent something like a Light or a Door Lock. You can find the Zigbee device type by entering the name of the device in the <strong>Device</strong> field.",
      "before": null,
      "placement": "left"
    },
    {
      "target": ".v-step-3",
      "title": "",
      "content": "An endpoint can be assigned a network id that corresponds to which <strong>network</strong> it is on.",
      "before": null,
      "placement": "left"
    },
    {
      "target": ".v-step-4",
      "title": "",
      "content": "Once you have configured the endpoint, click <strong>CREATE</strong> to add the endpoint to your configuration.",
      "before": "createMockEndpoint",
      "placement": "right"
    },
    {
      "target": ".v-step-5",
      "title": "Modifying an Endpoint",
      "content": "To modify an endpoint, click on the endpoint configuration on the left side of the ZCL Advanced Platform (ZAP). A <strong>blue background</strong> corresponds to the endpoint being modified.",
      "before": "generateEndpointCard",
      "placement": "bottom"
    },
    {
      "target": ".v-step-6",
      "title": "",
      "content": "The clusters of the highlighted endpoint can be modified on the right side of the ZCL Advanced Platform (ZAP).",
      "before": null,
      "placement": "right"
    },
    {
      "target": ".v-step-7",
      "title": "",
      "content": "The Show dropdown shows all the available clusters for a certain endpoint. Selecting the <strong>Enabled Clusters</strong> option will display only clusters enabled on the endpoint.",
      "before": "showFilter",
      "placement": "right"
    },
    {
      "target": ".v-step-8",
      "title": "Configuring a Cluster",
      "content": "You can enable the Client and/or Server sides of a cluster through changing the <strong>Client and Server</strong> settings in the Enable column. In order to remove a cluster from a configuration, select the <strong>Not Enabled</strong> option. Depending on the changes you make, you may be notified that components have been added to your project.",
      "before": "expandCluster",
      "placement": "left"
    },
    {
      "target": ".v-step-9",
      "title": "Configuring a Cluster",
      "content": "Each cluster can be configured to implement Zigbee cluster attributes and commands. The Enable Command Discovery toggle in the top interface ribbon allows the list of commands supported by the device to be visible.",
      "before": "comeBackToHomePage",
      "placement": "left"
    },
    {
      "target": ".v-step-10",
      "title": "Configuring Attributes",
      "content": "Attribute configurations can be updated in this tab.",
      "before": "openConfigure",
      "placement": "bottom"
    },
    {
      "target": ".v-step-11",
      "title": "Configuring Attribute Reporting",
      "content": "Default attribute reporting is configured in this tab.",
      "before": null,
      "placement": "bottom"
    },
    {
      "target": ".v-step-12",
      "title": "Commands",
      "content": "You can manage the handling of commands for a cluster in this tab.",
      "before": null,
      "placement": "bottom"
    },
    {
      "target": ".v-step-13",
      "title": "",
      "content": "To enable or disable an attribute, click on the <strong>On/Off</strong> toggle. The attribute is <strong>ON</strong> when the toggle is shaded blue and to the right, and <strong>OFF</strong> when the toggle is shaded gray and to the left.",
      "before": "backToAttributesTab",
      "placement": "bottom"
    },
    {
      "target": ".v-step-14",
      "title": "",
      "content": "Default attribute reporting is also controlled through the toggle. If the toggle is on, the attribute is set up to be reported by default.",
      "before": "openReportTabInCluster",
      "placement": "bottom"
    },
    {
      "target": ".v-step-15",
      "title": "",
      "content": "For instance, in the following example, Endpoint 1 only implements the Server side of the On/Off cluster. Therefore, it is only possible for the cluster to receive the Off command ‘In’, which is in fact enabled for that cluster. With this setting enabled, the ZCL Advanced Platform (ZAP) automatically generates command handling code for handling the On/Off cluster’s ‘Off’ command. This will ensure that, when an ‘Off’ command is received, it will be routed to the correct command handling callback.",
      "before": "openCommandsTabInCluster",
      "placement": "bottom"
    },
    {
      "target": ".v-step-16",
      "title": "Adding Custom Clusters",
      "content": "In Zigbee, the Zigbee Cluster Library (ZCL) allows developers to add their own custom clusters to their applications. The custom ZCL must be described in the Silicon Labs ZCL XML format. For examples of custom ZCL XML, see the file sampleextensions.xml in the <GSDK install location>/app/zcl directory. This XML file can be used as a reference for your custom ZCL XML file. Once you have created your custom ZCL XML file, it can be added to your project through the ZCL EXTENSIONS… interface.",
      "before": "backToHomePage",
      "placement": "bottom"
    },
    {
      "target": ".v-step-16",
      "title": "",
      "content": "Clicking <strong>ZCL EXTENSIONS…</strong> opens the Custom ZCL page in the ZCL Advanced Platform (ZAP). Click <strong>Add</strong> to add your custom ZCL XML to the project. Browse to the location of the custom ZCL XML, select a file, and click <strong>Open</strong>. Once the custom ZCL XML has been read into the ZCL Advanced Platform (ZAP), your custom clusters, attributes, commands, and so on are accessible to the configuration of your application.",
      "before": "openZclExtensionTab",
      "placement": "bottom"
    }
  ]
}
